Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/index.html.txt.tmx
Source language: en
Languages: ga

source: An outline of the courts and the offices that support them
ga: Tá eolas anseo faoí na cúirteanna agus na hoifigí a thugann tacaíocht dóibh

source: The Children Court deals with children under 18 years of age and came into operation in 2002
ga: Bíonn an Chúirt Leanaí ag déileáil le leanaí faoi 18 mbliana d'aois agus tháinig sé i bhfeidhm i 2002

source: The Children Act 2001 sets out the various rules regarding the Children Court
ga: Leagann Acht Leanaí 2001 amach na rialacha difriúla maidir leis an gCúirt Leanaí

source: The District Court is organised on a regional basis and is the lowest court in the Irish court system
ga: Tá eolas anseo faoin gCúirt Dúichet

source: The small claims procedure provides an inexpensive, fast and easy way for consumers to resolve disputes without a solicitor
ga: Déantar cur síos sa doiciméad seo ar an chaoi a n-oibríonn nós imeachta um éilimh bheaga

source: European small claims procedure
ga: Nós imeachta Eorpach um éilimh bheaga

source: The Circuit Court is a court of local and limited jurisdiction
ga: Déantar cur síos anseo ar an gCúirt Chuarda

source: Find out where, and how matters are heard in this court
ga: Tugtar eolas anseo faoín Ardchúirt

source: The Commercial Court provides efficient dispute resolution in commercial cases
ga: Soláthraíonn an Chúirt Tráchtála taifeach díospóide feidhmiúla i gcásanna tráchtála

source: The composition and jurisdiction of the Special Criminal Court in Ireland is described
ga: Déanamh suas agus dlínse an Chúirt Choiriúil Speisialta

source: The main function of the Court of Appeal is to hear appeals from the High Court and the Circuit Court
ga: Is í príomhfheidhm na Cúirte Achomhairc éisteacht le hachomhairc ón Ard-Chúirt agus ón gCúirt Chuarda

source: Court of Criminal Appeal
ga: An Chúirt Achomharc Choiriúil

source: The Court of Criminal Appeal was abolished
ga: Tá an Chúirt Achomhairc Choiriúil a dhíothú

source: Criminal appeals are heard by the Court of Appeal
ga: Éisteann an Chúirt Achomhairc achomhairc nua

source: Supreme Court of Ireland
ga: Cúirt Uachtarach na hÉireann

source: The Irish Constitution makes provision for a Court of Final Appeal - the Supreme Court
ga: Déanann an Cáipéis seo cur síos ar an gCúirt Uachtarach

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
